# Week 7 Assignment
Student: Tim Lynch<br>
Professor: Charles Pak<br>

__1.Load the ratings by user information that you collected into a pandas dataframe.__


__2.Show the average ratings for each user and each movie.__


__3.Create a new pandas dataframe, with normalized ratings for each user. Again, show the average ratings for each user and each movie.__


__4.Provide a text-based conclusion:explain what might be advantages and disadvantages of using normalized ratings instead of the actual ratings.__


### Extra Credit
__5.Create another new pandas dataframe, with standardized ratings for each user. Once again, show the average ratings for each user and each movie__

In [3]:
#Import pandas
import pandas as pd

movie_data = pd.read_csv('movies.csv')

In [4]:
movie_data

,Names,American Sniper,Edge of Tomorrow,Groundhog Day,Jurassic World,Lost in Translation,Lucy
0,John,5.0,4.0,3,NaN,NaN,4.0
1,Logan,4.0,NaN,3,3.0,NaN,NaN
2,Modesto,NaN,NaN,4,NaN,4.0,4.0
3,Malcolm,NaN,NaN,2,NaN,4.0,NaN
4,Maurice,5.0,4.0,4,2.0,3.0,3.0

In [6]:
#Find out the types of the columns. 
type()

str

In [ ]:
#Convert to floats and insert 0's in NaN values